nxp-mcuxpresso/mcux-sdk-examples/kw45b41zevk/wireless_examples/bluetooth/adv_ext_peripheral/adv_ext_peripheral.c
/*! *********************************************************************************
* \addtogroup Extended Advertising Peripheral
* @{
********************************************************************************** */
/*! *********************************************************************************
* Copyright 2015 Freescale Semiconductor, Inc.
* Copyright 2020 - 2024 NXP
*
*
* \file
*
* This file is the source file for the extended advertising peripheral application
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */

/************************************************************************************
*************************************************************************************
* Include
*************************************************************************************
************************************************************************************/
/* Framework / Drivers */
#include "EmbeddedTypes.h"
#include "RNG_Interface.h"
#include "fsl_component_button.h"
#include "fsl_component_led.h"
#include "fsl_component_timer_manager.h"
#include "fsl_component_mem_manager.h"
#include "fsl_component_panic.h"
#include "fsl_component_serial_manager.h"
#include "fsl_format.h"
#include "FunctionLib.h"
#include "sensors.h"


/* BLE Host Stack */
#include "gatt_server_interface.h"
#include "gatt_client_interface.h"
#include "gap_interface.h"
#include "gatt_db_handles.h"

/* Profile / Services */
#include "battery_interface.h"
#include "device_info_interface.h"
#include "temperature_interface.h"

/* Connection Manager */
#include "ble_conn_manager.h"

#include "board.h"
#include "app_conn.h"
#include "app_advertiser.h"
#include "app.h"
#include "adv_ext_peripheral.h"

/************************************************************************************
*************************************************************************************
* Private macros
*************************************************************************************
************************************************************************************/
#define mNumberOfAdvHandles_c    (2U)
#define mInvalidAdvHandle      (0xffU)

#ifndef mAE_PeripheralDebug_c
#define mAE_PeripheralDebug_c   (0)
#endif

#define mChangePerAdvDataOption_c              (6U)
#define mChangeNonConnNonScannAdvDataOption_c  (5U)

#define Serial_Print(a,b,c)     (void)SerialManager_WriteBlocking((serial_write_handle_t)s_writeHandle, (uint8_t *)&(b)[0], strlen(b))
#define Serial_PrintDec(a,b)    (void)SerialManager_WriteBlocking((serial_write_handle_t)s_writeHandle, FORMAT_Dec2Str(b), strlen((char const *)FORMAT_Dec2Str(b)))
#define AppPrintString(b)       (void)SerialManager_WriteBlocking((serial_write_handle_t)s_writeHandle, (uint8_t *)&(b)[0], strlen(b))

/************************************************************************************
*************************************************************************************
* Private type definitions
*************************************************************************************
************************************************************************************/

typedef enum
{
    madvHandle_Available_c,
    madvHandle_InUse_c,
}advHandleStatus_t;

typedef enum
{
    mAdvStatus_Off_c,
    mAdvStatus_On_c
}advStatus_t;

typedef enum
{
    mLegacyAdvIndex_c = 0,
    mExtAdvScannIndex_c,
    mExtAdvConnIndex_c,
    mExtAdvNonConnNonScanIndex_c,
    mPeriodicAdvIndex_c,
    mAdvIndexMax_c
}advIndex_t;

typedef enum
{
    mExtAdvSeq_Idle_c,
    mExtAdvSeq_Start_c,
    mExtAdvSeq_Stop_c,
    mExtAdvSeq_ChangeExtAdvData_c,
    mExtAdvSeq_ChangePeriodicData_c
}extAdvSequence_t;

typedef enum {gApiReq_Success_c, gApiReq_Denied_c }apiReqStatus_t;
typedef enum {mSS_PrintMenu_c, mSS_WaitOption_c, mSS_HandleOption_c}switch2Status_t;

typedef struct appPeerDevice_tag
{
    deviceId_t deviceId;
    TIMER_MANAGER_HANDLE_DEFINE(timerId);
}appPeerDevice_t;
/************************************************************************************
*************************************************************************************
* Private memory declarations
*************************************************************************************
************************************************************************************/

/* Adv State */
static extAdvSequence_t mExtAdvSequence;
static advStatus_t maAdvStatus[mAdvIndexMax_c];

static advIndex_t mExtAdvAPIOwner = mAdvIndexMax_c;

/* Service Data*/
static bool_t           basValidClientList[gAppMaxConnections_c] = {FALSE};
static basConfig_t      basServiceConfig = {(uint16_t)service_battery, 0, basValidClientList, gAppMaxConnections_c};
static disConfig_t      disServiceConfig = {(uint16_t)service_device_info};

static tmsConfig_t tmsServiceConfig = {(uint16_t)service_temperature, 0};

/* Application specific data*/
static appPeerDevice_t maPeerDeviceId[gAppMaxConnections_c];

#if (defined(gAppButtonCnt_c) && (gAppButtonCnt_c > 0))
static switch2Status_t switch2Status = mSS_PrintMenu_c;
static uint8_t menuOption = 0;
static char* legacyAdvStrings[] = {"\n\r 1. Start Legacy Advertising",\
                                         "\n\r 1. Stop Legacy Advertising",
                                         "\n\rConnected"};
static char* extAdvScannStrings[] = {"\n\r 2. Start Extended Scannable Advertising",\
                                           "\n\r 2. Stop Extended Scannable Advertising"};
static char* extAdvConnStrings[] = {"\n\r 3. Start Extended Connectable Advertising",\
                                          "\n\r 3. Stop Extended Connectable Advertising",
                                          "\n\rConnected"};

static char* extAdvNonConnNonScanStrings[] = {"\n\r 4. Start Extended Non Connectable Non Scannable Advertising",\
        "\n\r 4. Stop Extended Non Connectable Non Scannable Advertising \n\r 6. Change Data for Non Connectable Non Scannable Advertising"};

