nxp-mcuxpresso/mcux-sdk-examples/kw45b41zevk/wireless_examples/bluetooth/adv_ext_peripheral/adv_ext_peripheral.c
static char* periodicAdvStrings[] = {"\n\r 5. Start Periodic Advertising",\
        "\n\r 5. Stop Periodic Advertising \n\r 7. Change Data for Periodic Advertising"};

static char** maMenu[]= {legacyAdvStrings, extAdvScannStrings, extAdvConnStrings, extAdvNonConnNonScanStrings, periodicAdvStrings};
static char* menuOptions[] ={"\r 1","\r 2", "\r 3", "\r 4", "\r 5", "\r 6", "\r 7"};
#endif /*gAppButtonCnt_c > 0*/
static advHandleStatus_t maAdvHandle[mNumberOfAdvHandles_c] = {madvHandle_Available_c, madvHandle_Available_c};
static advIndex_t maLastAdvIndexForThisHandle[mNumberOfAdvHandles_c]={ mAdvIndexMax_c, mAdvIndexMax_c};
static gapExtAdvertisingParameters_t* maPExtAdvParam[] = {&gExtAdvParamsLegacy, &gExtAdvParamsScannable, &gExtAdvParamsConnectable, &gExtAdvParamsNonConnNonScann };

static gapAdvertisingData_t* maPExtAdvData[] = {&gAppAdvertisingData , NULL, &gAppExtAdvDataConnectable, &gAppExtAdvDataId1NonConnNonScan };
static gapAdvertisingData_t* maPExtScanData[] = {&gAppScanRspData , &gAppExtAdvDataScannable, NULL, &gAppScanRspData };
static gapAdvertisingData_t* maPPeriodicAdvData[] = {&gAppExtAdvDataId1Periodic, &gAppExtAdvDataId2Periodic};
static gapAdvertisingData_t* maPExtAdvDataNonConnNonScan[] = {&gAppExtAdvDataId1NonConnNonScan, &gAppExtAdvDataId2NonConnNonScan};
static uint8_t mPeriodicAdvDataIndex = 0;
static uint8_t mExtAdvDataNCNSIndex = 0;

static char* advTypeStrings[] = {"\n\rLegacy Advertising",\
                                       "\n\rExtended Scanable Advertising",\
                                       "\n\rExtended Connectable Advertising",\
                                       "\n\rExtended Non Connectable Non Scanable Advertising",\
                                       "\n\rExtended Periodic Advertising"};

#if mAE_PeripheralDebug_c
static char* genericCBCKStrings[] = {\
    "gInitializationComplete_c",\
    "gInternalError_c",\
    "gAdvertisingSetupFailed_c",\
    "gAdvertisingParametersSetupComplete_c",\
    "gAdvertisingDataSetupComplete_c",\
    "gFilterAcceptListSizeRead_c",\
    "gDeviceAddedToFilterAcceptList_c",
    "gDeviceRemovedFromFilterAcceptList_c",\
    "gFilterAcceptListCleared_c",\
    "gRandomAddressReady_c",\
    "gCreateConnectionCanceled_c",\
    "gPublicAddressRead_c",\
    "gAdvTxPowerLevelRead_c",\
    "gPrivateResolvableAddressVerified_c",\
    "gRandomAddressSet_c",\
    "gLeScPublicKeyRegenerated_c",\
    "gLeScLocalOobData_c",\
    "gHostPrivacyStateChanged_c",\
    "gControllerPrivacyStateChanged_c",\
    "gControllerTestEvent_c",\
    "gTxPowerLevelSetComplete_c",\
    "gLePhyEvent_c",\
    "gControllerNotificationEvent_c",\
    "gBondCreatedEvent_c",\
    "gChannelMapSet_c",\
    "gExtAdvertisingParametersSetupComplete_c",\
    "gExtAdvertisingDataSetupComplete_c",\
    "gExtAdvertisingSetRemoveComplete_c",\
    "gPeriodicAdvParamSetupComplete_c",\
    "gPeriodicAdvDataSetupComplete_c",\
    "gPeriodicAdvListUpdateComplete_c",\
    "gPeriodicAdvCreateSyncCancelled_c",\
    "gTxEntryAvailable_c",\
    "gPeriodicAdvertisingStateChanged_c"};

static char* advertisingCBCKStrings[] = {\
    "gAdvertisingStateChanged_c",\
    "gAdvertisingCommandFailed_c",\
    "gExtAdvertisingStateChanged_c",\
    "gAdvertisingSetTerminated_c",\
    "gExtScanNotification_c"};
#endif

/*serial manager handle*/
static serial_handle_t gAppSerMgrIf;
/*write handle*/
static SERIAL_MANAGER_WRITE_HANDLE_DEFINE(s_writeHandle);
/*read handle*/
static SERIAL_MANAGER_READ_HANDLE_DEFINE(s_readHandle);

static appExtAdvertisingParams_t mAppExtAdvParams;

/************************************************************************************
*************************************************************************************
* Private functions prototypes
*************************************************************************************
************************************************************************************/

/* Gatt and Att callbacks */
static void BleApp_AdvertisingCallback (gapAdvertisingEvent_t* pAdvertisingEvent);
static void BleApp_ConnectionCallback (deviceId_t peerDeviceId, gapConnectionEvent_t* pConnectionEvent);
static void BleApp_GattServerCallback (deviceId_t deviceId, gattServerEvent_t* pServerEvent);
static void BluetoothLEHost_Initialized(void);
static void BluetoothLEHost_GenericCallback(gapGenericEvent_t *pGenericEvent);

/* Timer Callbacks */
static void DisconnectTimerCallback(void *pParam);

static void BleApp_SendTemperature(deviceId_t deviceId);

static void AppPrintLePhyEvent(gapPhyEvent_t* pPhyEvent);
#if (defined(gAppButtonCnt_c) && (gAppButtonCnt_c > 0))
static void Uart_PrintMenu(void *pData);
static void Key_HandleOption(void *pData);
#endif /*gAppButtonCnt_c > 0*/
static void AppPrintDec(uint32_t nb);
#if (defined(gAppButtonCnt_c) && (gAppButtonCnt_c > 0))
static void AppPrintStringCallback(void* pData);
#endif /*gAppButtonCnt_c > 0*/
static uint8_t Alloc_AdvHandler(void);
static void Free_AdvHandler(uint8_t advHandle);
static bool_t AllAdvertisingsAreOff(void);
static apiReqStatus_t ExtAdvAPIRequest(advIndex_t advIndex);
static void  FreeExtAdvAPI(void);
static void  EndSequence(void);
static bool_t Add_PeerDevice(deviceId_t deviceId);
static void Remove_PeerDevice(deviceId_t deviceId);
static uint8_t Get_PeerDeviceIndex(deviceId_t deviceId);
#if (defined(gAppButtonCnt_c) && (gAppButtonCnt_c > 0))
static void Disconnect_AllPeerDevices(void);
#endif /*gAppButtonCnt_c > 0*/
static uint8_t NumberOf_PeerDevices(void);
static void BleApp_SerialInit(void);

static void BleApp_HandleExtAdvNonConnNonScannMode(uint8_t mode);
static void BleApp_HandlePeriodicAdvMode(uint8_t mode);
static void BleApp_HandleChangePerAdvDataMode(void);
static void BleApp_HandleChangeNonConnNonScannAdvDataMode(void);

/************************************************************************************
*************************************************************************************
* Public functions
*************************************************************************************
************************************************************************************/

/*! *********************************************************************************
* \brief    Initializes application specific functionality before the BLE stack init.
*
********************************************************************************** */
void BluetoothLEHost_AppInit(void)
{
    BleApp_SerialInit();
#if (defined(gAppButtonCnt_c) && (gAppButtonCnt_c > 0))
    (void)BUTTON_InstallCallback((button_handle_t)g_buttonHandle[0], BleApp_HandleKeys0, NULL);
#if (defined(gAppButtonCnt_c) && (gAppButtonCnt_c > 1))
    (void)BUTTON_InstallCallback((button_handle_t)g_buttonHandle[1], BleApp_HandleKeys1, NULL);
#endif
#endif
    /* Set generic callback */
    BluetoothLEHost_SetGenericCallback(BluetoothLEHost_GenericCallback);

