nxp-mcuxpresso/mcux-sdk-examples/kw45b41zevk/wireless_examples/bluetooth/adv_ext_peripheral/adv_ext_peripheral.c
    /* Initialize Bluetooth Host Stack */
    BluetoothLEHost_Init(BluetoothLEHost_Initialized);
}

/*! *********************************************************************************
* \brief    Starts the BLE application.
*
********************************************************************************** */
void BleApp_Start(uint8_t mode)
{
    switch(mode)
    {
    case (uint8_t)mLegacyAdvIndex_c:
    case (uint8_t)mExtAdvScannIndex_c:
    case (uint8_t)mExtAdvConnIndex_c:
    case (uint8_t)mExtAdvNonConnNonScanIndex_c:
        BleApp_HandleExtAdvNonConnNonScannMode(mode);
        break;

    case (uint8_t)mPeriodicAdvIndex_c:
        BleApp_HandlePeriodicAdvMode(mode);
        break;

    case mChangePerAdvDataOption_c:
        BleApp_HandleChangePerAdvDataMode();
        break;

    case mChangeNonConnNonScannAdvDataOption_c:
        BleApp_HandleChangeNonConnNonScannAdvDataMode();
        break;
    default:
        {
            ; /* No action required */
        }
        break;
    }
}

/*! *********************************************************************************
* \brief        Handles keyboard events.
*
* \param[in]    events    Key event structure.
********************************************************************************** */
#if (defined(gAppButtonCnt_c) && (gAppButtonCnt_c > 0))
button_status_t BleApp_HandleKeys0(void *buttonHandle, button_callback_message_t *message,void *callbackParam)
{
    switch (message->event)
    {
    case kBUTTON_EventOneClick:
    case kBUTTON_EventShortPress:
    case kBUTTON_EventLongPress:
        {
            uint8_t bmValidOption = (uint8_t)0x1fU |
                (((maAdvStatus[mExtAdvNonConnNonScanIndex_c] == mAdvStatus_On_c)? (uint8_t)1:(uint8_t)0)<<5) |
                    (((maAdvStatus[mPeriodicAdvIndex_c] == mAdvStatus_On_c)? (uint8_t)1:(uint8_t)0)<<6);
            do
            {
                menuOption = (menuOption + 1U)%NumberOfElements(menuOptions);
            }
            while( ((((uint8_t)1)<<menuOption) & bmValidOption) == 0U);
        }
        (void)App_PostCallbackMessage(AppPrintStringCallback, (void*)menuOptions[menuOption]);
        switch2Status = mSS_HandleOption_c;
        break;

    default:
        {
            ; /* No action required */
        }
        break;
    }
    return kStatus_BUTTON_Success;
}
#if (defined(gAppButtonCnt_c) && (gAppButtonCnt_c > 1))
button_status_t BleApp_HandleKeys1(void *buttonHandle, button_callback_message_t *message,void *callbackParam)
{
    switch (message->event)
    {
        /* Start the application */
        case kBUTTON_EventOneClick:
        case kBUTTON_EventShortPress:
            {
                if(switch2Status == mSS_PrintMenu_c )
                {
                    switch2Status = mSS_WaitOption_c;
                    menuOption = NumberOfElements(menuOptions) - 1U;
                    (void)App_PostCallbackMessage(Uart_PrintMenu, NULL);
                }
                else if(switch2Status == mSS_HandleOption_c )
                {
                    switch2Status = mSS_PrintMenu_c;
                    (void)App_PostCallbackMessage(Key_HandleOption, &menuOption);
                }
                else
                {
                    ;/*misra compliance purposes*/
                }
            }
            break;

        /* Disconnect  */
        case kBUTTON_EventLongPress:
            {
                Disconnect_AllPeerDevices();
            }
            break;

        default:
            {
                ; /* No action required */
            }
            break;
    }
    return kStatus_BUTTON_Success;
}
#endif /*gAppButtonCnt_c > 1*/
#endif /*gAppButtonCnt_c > 0*/

/************************************************************************************
*************************************************************************************
* Private functions
*************************************************************************************
************************************************************************************/

/*! *********************************************************************************
* \brief        Configures BLE Stack after initialization.
*
********************************************************************************** */
static void BluetoothLEHost_Initialized(void)
{
    /* Common GAP configuration */
    BleConnManager_GapCommonConfig();

    /* Register for callbacks*/
    (void)App_RegisterGattServerCallback(BleApp_GattServerCallback);

    FLib_MemSet (maAdvStatus, (uint8_t)mAdvStatus_Off_c, sizeof(maAdvStatus));

    /* Start services */
    SENSORS_TriggerTemperatureMeasurement();
    (void)SENSORS_RefreshTemperatureValue();
    /* Multiply temperature value by 10. SENSORS_GetTemperature() reports temperature
    value in tenths of degrees Celsius. Temperature characteristic value is degrees
    Celsius with a resolution of 0.01 degrees Celsius (GATT Specification
    Supplement v6). */
    tmsServiceConfig.initialTemperature = (int16_t)(10 * SENSORS_GetTemperature());
    (void)Tms_Start(&tmsServiceConfig);

    basServiceConfig.batteryLevel = SENSORS_GetBatteryLevel();
    (void)Bas_Start(&basServiceConfig);
    (void)Dis_Start(&disServiceConfig);

    /* Allocate application timer */
    {
        uint8_t i;
        for( i = 0; i < gAppMaxConnections_c; i++ )
        {
            timer_status_t timerStatus;
            maPeerDeviceId[i].deviceId = gInvalidDeviceId_c;
            timerStatus = TM_Open(maPeerDeviceId[i].timerId);
            if(timerStatus != kStatus_TimerSuccess)
            {
                panic(0,0,0,0);
            }
        }
    }
    AppPrintString("\n\rExtended Advertising Application - Peripheral");
    AppPrintString("\n\rPress WAKESW to see the menu");

    LedStopFlashingAllLeds();
    Led1On();
    Led2On();
}

/*! *********************************************************************************
* \brief        Handles BLE generic callback.
*
* \param[in]    pGenericEvent    Pointer to gapGenericEvent_t.
********************************************************************************** */
static void BluetoothLEHost_GenericCallback (gapGenericEvent_t* pGenericEvent)
{
    bleResult_t bleResult;

#if mAE_PeripheralDebug_c
    AppPrintString("\n\rGeneric Callback - ");
    AppPrintString(genericCBCKStrings[pGenericEvent->eventType]);
#endif
    /* Call BLE Conn Manager */
    BleConnManager_GenericEvent(pGenericEvent);
    switch (pGenericEvent->eventType)
    {
    case gExtAdvertisingParametersSetupComplete_c:
    case gExtAdvertisingDataSetupComplete_c:
        {
            maLastAdvIndexForThisHandle[maPExtAdvParam[mExtAdvAPIOwner]->handle] = mExtAdvAPIOwner;
        }
      break;
    case gPeriodicAdvParamSetupComplete_c:
        {
            bleResult = Gap_SetPeriodicAdvertisingData(gPeriodicAdvParams.handle, maPPeriodicAdvData[mPeriodicAdvDataIndex], FALSE);
            if(gBleSuccess_c != bleResult)
            {
                AppPrintString("\n\r Gap_SetPeriodicAdvertisingData Failed");
                EndSequence();
            }
        }
        break;
    case gPeriodicAdvDataSetupComplete_c:
        {
            if(gBleSuccess_c != Gap_StartPeriodicAdvertising(gPeriodicAdvParams.handle, FALSE))
            {
                AppPrintString("\n\r Gap_StartPeriodicAdvertising Failed");
                EndSequence();
            }
        }
        break;
    case gAdvertisingSetupFailed_c:
        EndSequence();
        break;
    case gExtAdvertisingSetRemoveComplete_c:
        AppPrintString(advTypeStrings[maLastAdvIndexForThisHandle[maPExtAdvParam[mExtAdvAPIOwner]->handle]]);
        AppPrintString(" Removed" );
        maLastAdvIndexForThisHandle[maPExtAdvParam[mExtAdvAPIOwner]->handle] = mAdvIndexMax_c;
        if(mExtAdvSequence == mExtAdvSeq_Start_c)
        {
            if(gBleSuccess_c != BluetoothLEHost_StartExtAdvertising(&mAppExtAdvParams, BleApp_AdvertisingCallback, BleApp_ConnectionCallback))
            {
                AppPrintString("\n\rGap_SetExtAdvertisingParameters failed");
                EndSequence();
            }
        }
        else
        {
            maAdvStatus[mExtAdvAPIOwner] = mAdvStatus_Off_c;
            EndSequence();
        }
        break;
    case gLePhyEvent_c:
        if(pGenericEvent->eventData.phyEvent.phyEventType == gPhyUpdateComplete_c )
        {
            AppPrintLePhyEvent(&pGenericEvent->eventData.phyEvent);
        }
        break;
    case gPeriodicAdvertisingStateChanged_c:

        if(maAdvStatus[mExtAdvAPIOwner] == mAdvStatus_On_c)
        {
            maAdvStatus[mExtAdvAPIOwner] = mAdvStatus_Off_c;
            AppPrintString(advTypeStrings[mExtAdvAPIOwner]);
            AppPrintString(" Stopped" );
            if(mExtAdvSequence == mExtAdvSeq_ChangePeriodicData_c)
            {
                if(gBleSuccess_c !=  Gap_SetPeriodicAdvertisingData(gPeriodicAdvParams.handle, maPPeriodicAdvData[mPeriodicAdvDataIndex], FALSE))
                {
                    AppPrintString("\n\rGap_SetPeriodicAdvertisingData failed");
                    EndSequence();
                }
            }
            else
            {
                EndSequence();
            }
        }
        else
        {
            maAdvStatus[mExtAdvAPIOwner] = mAdvStatus_On_c;
            AppPrintString(advTypeStrings[mExtAdvAPIOwner]);
            AppPrintString(" Started" );
            if(mExtAdvSequence == mExtAdvSeq_ChangePeriodicData_c)
            {
                AppPrintString(advTypeStrings[mExtAdvAPIOwner]);
                AppPrintString(" Data Changed" );
            }
            EndSequence();
        }
        break;
    default:
        {
            ; /* No action required */
        }
        break;
    }
}

/*! *********************************************************************************
* \brief        Handles BLE Advertising callback from host stack.
*
* \param[in]    pAdvertisingEvent    Pointer to gapAdvertisingEvent_t.
********************************************************************************** */
static void BleApp_AdvertisingCallback (gapAdvertisingEvent_t* pAdvertisingEvent)
{
#if mAE_PeripheralDebug_c
    AppPrintString("\n\rAdvertising Callback - ");
    AppPrintString(advertisingCBCKStrings[pAdvertisingEvent->eventType]);
#endif
    switch (pAdvertisingEvent->eventType)
    {

    case gAdvertisingStateChanged_c:

        break;

