nxp-mcuxpresso/mcux-sdk-examples/kw45b41zevk/wireless_examples/bluetooth/adv_ext_peripheral/adv_ext_peripheral.c
    case gAdvertisingCommandFailed_c:
        {
            /* Panic UI */
            EndSequence();
            panic(0,0,0,0);
        }
        break;

    case gExtAdvertisingStateChanged_c:

        if(maAdvStatus[mExtAdvAPIOwner] == mAdvStatus_On_c)
        {
            maAdvStatus[mExtAdvAPIOwner] = mAdvStatus_Off_c;
            AppPrintString(advTypeStrings[mExtAdvAPIOwner]);
            AppPrintString(" Stopped" );
            if(mExtAdvSequence == mExtAdvSeq_ChangeExtAdvData_c)
            {
                if(gBleSuccess_c != Gap_SetExtAdvertisingData(maPExtAdvParam[mExtAdvAPIOwner]->handle, maPExtAdvData[mExtAdvAPIOwner], maPExtScanData[mExtAdvAPIOwner]))
                {
                    AppPrintString("\n\rGap_SetExtAdvertisingData failed");
                    EndSequence();
                }
            }
            if(mExtAdvSequence == mExtAdvSeq_Stop_c)
            {
                maAdvStatus[mExtAdvAPIOwner] = mAdvStatus_Off_c;
                EndSequence();
            }
        }
        else
        {
            Led1Flashing();
            maAdvStatus[mExtAdvAPIOwner] = mAdvStatus_On_c;
            maLastAdvIndexForThisHandle[maPExtAdvParam[mExtAdvAPIOwner]->handle] = mExtAdvAPIOwner;
            AppPrintString(advTypeStrings[mExtAdvAPIOwner]);
            AppPrintString(" Started on handle " );
            AppPrintDec((uint32_t)maPExtAdvParam[mExtAdvAPIOwner]->handle);
            if(mExtAdvSequence == mExtAdvSeq_ChangeExtAdvData_c)
            {
                AppPrintString(advTypeStrings[mExtAdvAPIOwner]);
                AppPrintString(" Data Changed" );
            }
            EndSequence();
        }
        break;
    case gAdvertisingSetTerminated_c:
        {
            uint8_t i;
            for( i=0; i < (uint8_t)mPeriodicAdvIndex_c; i++)
            {
                if((maAdvStatus[i] ==  mAdvStatus_On_c) && (maPExtAdvParam[i]->handle == pAdvertisingEvent->eventData.advSetTerminated.handle ))
                {
                    AppPrintString(advTypeStrings[i]);
                    AppPrintString(" Terminated on handle " );
                    AppPrintDec((uint32_t)maPExtAdvParam[i]->handle);
                    maAdvStatus[i] =  mAdvStatus_Off_c;
                    Free_AdvHandler(maPExtAdvParam[i]->handle);
                    if(AllAdvertisingsAreOff())
                    {
#if (defined(gAppLedCnt_c) && (gAppLedCnt_c == 1))
                        if(NumberOf_PeerDevices() == 0U)
                        {
#endif /* gAppLedCnt_c */
                            Led1Off();
                            Led1On();
#if (defined(gAppLedCnt_c) && (gAppLedCnt_c == 1))
                        }
#endif /* gAppLedCnt_c */
                    }
                    break;
                }
            }
        }
        break;
    default:
        {
            ; /* No action required */
        }
        break;
    }
}

/*! *********************************************************************************
* \brief        Handles BLE Connection callback from host stack.
*
* \param[in]    peerDeviceId        Peer device ID.
* \param[in]    pConnectionEvent    Pointer to gapConnectionEvent_t.
********************************************************************************** */
static void BleApp_ConnectionCallback (deviceId_t peerDeviceId, gapConnectionEvent_t* pConnectionEvent)
{
    /* Connection Manager to handle Host Stack interactions */
    BleConnManager_GapPeripheralEvent(peerDeviceId, pConnectionEvent);

    switch (pConnectionEvent->eventType)
    {
    case gConnEvtConnected_c:
        {
            /* Advertising stops when connected */
            /* Subscribe client*/
            (void)Add_PeerDevice(peerDeviceId);
            (void)Bas_Subscribe(&basServiceConfig, peerDeviceId);
            (void)Tms_Subscribe(peerDeviceId);
            (void)Serial_Print(gAppSerMgrIf, "\n\rConnected!\n\r", gAllowToBlock_d);
            /* UI */
#if (defined(gAppLedCnt_c) && (gAppLedCnt_c == 1))
            LedSetColor(0, kLED_Blue);
            Led1Flashing();
#else /* gAppLedCnt_c */
            Led2Flashing();
#endif /* gAppLedCnt_c */
        }
        break;

    case gConnEvtDisconnected_c:
        {
            /* Unsubscribe client */
            Remove_PeerDevice(peerDeviceId);
            (void)Bas_Unsubscribe(&basServiceConfig, peerDeviceId);
            (void)Tms_Unsubscribe();
            (void)Serial_Print(gAppSerMgrIf, "\n\rDisconnected!\n\r", gAllowToBlock_d);
            if(NumberOf_PeerDevices() == 0U)
            {
                /* UI */
#if (defined(gAppLedCnt_c) && (gAppLedCnt_c == 1))
                LedSetColor(0, kLED_White);
                Led1On();
#else /* gAppLedCnt_c */
                Led2Off();
                Led2On();
#endif /* gAppLedCnt_c */
            }
        }
        break;

    case gConnEvtEncryptionChanged_c:   /* Fall-through */
    default:
        {
            ; /* No action required */
        }
        break;
    }
}

/*! *********************************************************************************
* \brief        Handles GATT server callback from host stack.
*
* \param[in]    deviceId        Peer device ID.
* \param[in]    pServerEvent    Pointer to gattServerEvent_t.
********************************************************************************** */
static void BleApp_GattServerCallback (deviceId_t deviceId, gattServerEvent_t* pServerEvent)
{
    switch (pServerEvent->eventType)
    {
    case gEvtCharacteristicCccdWritten_c:
        {
            /* Notify the temperature value when CCCD is written */
            BleApp_SendTemperature(deviceId);
        }
        break;

    default:
        {
            ; /* No action required */
        }
        break;
    }
}

/*! *********************************************************************************
* \brief        Handles disconnect timer callback.
*
* \param[in]    pParam        Callback parameters.
********************************************************************************** */
static void DisconnectTimerCallback(void* pParam)
{
    /* Terminate connection */
    appPeerDevice_t* pAppPeerDevice = (appPeerDevice_t*)pParam;
    if (pAppPeerDevice->deviceId != gInvalidDeviceId_c)
    {
        (void)Gap_Disconnect(pAppPeerDevice->deviceId);
    }
}

/*! *********************************************************************************
* \brief        Sends temperature value over-the-air.
*
********************************************************************************** */
static void BleApp_SendTemperature(deviceId_t deviceId)
{
    uint8_t peerIndex;
    peerIndex = Get_PeerDeviceIndex(deviceId);
    if(peerIndex < gAppMaxConnections_c)
    {
        (void)TM_Stop((timer_handle_t)maPeerDeviceId[peerIndex].timerId);

        /* Update with initial temperature */
        SENSORS_TriggerTemperatureMeasurement();
        (void)SENSORS_RefreshTemperatureValue();
        
