nxp-mcuxpresso/mcux-sdk-examples/kw45b41zevk/wireless_examples/bluetooth/adv_ext_peripheral/adv_ext_peripheral.c
        /* Multiply temperature value by 10. SENSORS_GetTemperature() reports temperature
        value in tenths of degrees Celsius. Temperature characteristic value is degrees
        Celsius with a resolution of 0.01 degrees Celsius (GATT Specification
        Supplement v6). */
        (void)Tms_RecordTemperatureMeasurement((uint16_t)service_temperature,
                                               (int16_t)(SENSORS_GetTemperature() * 10));

         /* Start Sleep After Data timer */
         (void)TM_InstallCallback((timer_handle_t)maPeerDeviceId[peerIndex].timerId, DisconnectTimerCallback, &maPeerDeviceId[peerIndex]);
         (void)TM_Start((timer_handle_t)maPeerDeviceId[peerIndex].timerId, (uint8_t)kTimerModeLowPowerTimer | (uint8_t)kTimerModeSetSecondTimer | (uint8_t)kTimerModeSingleShot, gGoToSleepAfterDataTime_c);
    }
}

/*! *********************************************************************************
* \brief        Prints a uint32_t value in decimal.
*
********************************************************************************** */
static void AppPrintDec(uint32_t nb)
{
    (void)Serial_PrintDec(gAppSerMgrIf, nb);
}
/*! *********************************************************************************
* \brief        Prints a string from the app task.
*
********************************************************************************** */
#if (defined(gAppButtonCnt_c) && (gAppButtonCnt_c > 0))
static void AppPrintStringCallback(void* pData)
{
    char* pBuff = (char*)pData;
    (void)Serial_Print(gAppSerMgrIf, pBuff, gAllowToBlock_d);
}
#endif /*gAppButtonCnt_c > 0*/

/*! *********************************************************************************
* \brief        Prints phy event.
*
********************************************************************************** */
static void AppPrintLePhyEvent(gapPhyEvent_t* pPhyEvent)
{
    /* String dictionary corresponding to gapLePhyMode_t */
    static char* mLePhyModeStrings[] =
    {
        "Invalid\n\r",
        "1M\n\r",
        "2M\n\r",
        "Coded\n\r",
    };
    uint8_t txPhy = (pPhyEvent->txPhy <= (uint8_t)gLePhyCoded_c) ? pPhyEvent->txPhy : (0U);
    uint8_t rxPhy = (pPhyEvent->rxPhy <= (uint8_t)gLePhyCoded_c) ? pPhyEvent->rxPhy : (0U);
    AppPrintString("Phy Update Complete.\n\r");
    AppPrintString("TxPhy ");
    AppPrintString(mLePhyModeStrings[txPhy]);
    AppPrintString("RxPhy ");
    AppPrintString(mLePhyModeStrings[rxPhy]);
}

/*! *********************************************************************************
* \brief        prints application menu.
*
* \param[in]    pData        Parameters.
********************************************************************************** */
#if (defined(gAppButtonCnt_c) && (gAppButtonCnt_c > 0))
static void Uart_PrintMenu(void *pData)
{
    uint8_t i;
    AppPrintString("\n\r Menu");
    for( i = 0 ; i < (uint8_t)mAdvIndexMax_c; i++)
    {
        AppPrintString((maMenu[i])[(uint8_t)maAdvStatus[i]]);
    }
    AppPrintString("\n\rPress OPTSW to choose an option\n\rThen confirm it with the WAKESW\n\r");
}

/*! *********************************************************************************
* \brief        Handles the keyboard option.
*
* \param[in]    pData        Parameters.
********************************************************************************** */
static void Key_HandleOption(void *pData)
{
    uint8_t keyOption = *((uint8_t*)pData);
    BleApp_Start(keyOption);
}
#endif /*gAppButtonCnt_c > 0*/

/*! *********************************************************************************
* \brief        Allocates the first available advertising handler .
*
* \param[in]    none
********************************************************************************** */
static uint8_t Alloc_AdvHandler(void)
{
    uint8_t i, advHandle;
    advHandle = mInvalidAdvHandle;
    OSA_InterruptDisable();
    for( i=0; i < mNumberOfAdvHandles_c; i++)
    {
        if(maAdvHandle[i] == madvHandle_Available_c)
        {
            maAdvHandle[i] = madvHandle_InUse_c;
            advHandle = i;
            break;
        }
    }
    OSA_InterruptEnable();
    return advHandle;
}

/*! *********************************************************************************
* \brief        Frees the advertising handle received as parameter.
*
* \param[in]    advHandle to free
********************************************************************************** */
static void Free_AdvHandler(uint8_t advHandle)
{
    OSA_InterruptDisable();
    if( advHandle <  mNumberOfAdvHandles_c)
    {
        if(maAdvHandle[advHandle] == madvHandle_InUse_c )
        {
            maAdvHandle[advHandle] = madvHandle_Available_c;
        }
    }
    OSA_InterruptEnable();
}

/*! *********************************************************************************
* \brief        Returns whether there is an advertising started or not.
*
* \param[in]    none
********************************************************************************** */
static bool_t AllAdvertisingsAreOff(void)
{
    bool_t result = TRUE;
    uint8_t i;
    for(i = 0; i< (uint8_t)mAdvIndexMax_c; i++)
    {
        if(maAdvStatus[i] != mAdvStatus_Off_c)
        {
            result = FALSE;
            break;
        }
    }
    return result;
}

/*! *********************************************************************************
* \brief        Function used to get access to the ext adv API.
*
* \param[in]    none
********************************************************************************** */
static apiReqStatus_t ExtAdvAPIRequest(advIndex_t advIndex)
{
    apiReqStatus_t   apiReqStatus = gApiReq_Denied_c;
    if(advIndex < mAdvIndexMax_c)
    {
        OSA_InterruptDisable();
        if(mExtAdvAPIOwner == mAdvIndexMax_c)
        {
            mExtAdvAPIOwner = advIndex;
        }
        if(mExtAdvAPIOwner == advIndex)
        {
            apiReqStatus = gApiReq_Success_c;
        }
        OSA_InterruptEnable();
    }
    return apiReqStatus;
}

/*! *********************************************************************************
* \brief        Function used to release the ext adv API.
*
* \param[in]    none
********************************************************************************** */
static void  FreeExtAdvAPI(void)
{
    mExtAdvAPIOwner = mAdvIndexMax_c;
}

/*! *********************************************************************************
* \brief        Function used to manage the end of a sequence.
*
* \param[in]    none
********************************************************************************** */
static void  EndSequence(void)
{
    mExtAdvSequence = mExtAdvSeq_Idle_c;
    if((mExtAdvAPIOwner < mPeriodicAdvIndex_c) && (maAdvStatus[mExtAdvAPIOwner] == mAdvStatus_Off_c))
    {
        Free_AdvHandler(maPExtAdvParam[mExtAdvAPIOwner]->handle);
        if(AllAdvertisingsAreOff())
        {
            Led1Off();
            Led1On();
        }
    }
    FreeExtAdvAPI();
}

/*! *********************************************************************************
* \brief        Add peer device in the peer array. Return FALSE if there is no room in the array
*               or the device is already there and TRUE otherwise.
*
* \param[in]    deviceId peer device to add
********************************************************************************** */
static bool_t Add_PeerDevice(deviceId_t deviceId)
{
    bool_t result = FALSE;
    uint8_t i;
    uint8_t firstFreeIndex = gAppMaxConnections_c;
    if( gInvalidDeviceId_c != deviceId )
    {
        result = TRUE;
        for( i = 0; i < gAppMaxConnections_c; i++ )
        {
            if(maPeerDeviceId[i].deviceId == gInvalidDeviceId_c)
            {
                if(firstFreeIndex == gAppMaxConnections_c)
                {
                    firstFreeIndex = i;
                }
            }
            else if(maPeerDeviceId[i].deviceId == deviceId)
            {
                result = FALSE;
                break;
            }
            else
            {
                ;
            }
        }
    }
    if(result == TRUE)
    {
        if(firstFreeIndex < gAppMaxConnections_c)
        {
            maPeerDeviceId[firstFreeIndex].deviceId = deviceId;
        }
        else
        {
            result = FALSE;
        }
    }
    return result;
}

/*! *********************************************************************************
* \brief        Removes peer device from the peer array.
*
* \param[in]    deviceId peer device to remove
********************************************************************************** */
static void Remove_PeerDevice(deviceId_t deviceId)
{
    uint8_t i;
    if( gInvalidDeviceId_c != deviceId )
    {
        for( i = 0; i < gAppMaxConnections_c; i++ )
        {
            if(maPeerDeviceId[i].deviceId == deviceId)
            {
                maPeerDeviceId[i].deviceId = gInvalidDeviceId_c;
                break;
            }
        }
    }
}
/*! *********************************************************************************
* \brief        Returns the peer array index of the peer device.
*
* \param[in]    deviceId peer device to search for
********************************************************************************** */
static uint8_t Get_PeerDeviceIndex(deviceId_t deviceId)
{
    uint8_t i = gAppMaxConnections_c;
    if( gInvalidDeviceId_c != deviceId )
    {
        for( i = 0; i < gAppMaxConnections_c; i++ )
        {
            if(maPeerDeviceId[i].deviceId == deviceId)
            {
                break;
            }
        }
    }
    return i;
}

/*! *********************************************************************************
* \brief        Disconnects all peer devices in the array
*
* \param[in]    none
********************************************************************************** */
#if (defined(gAppButtonCnt_c) && (gAppButtonCnt_c > 0))
static void Disconnect_AllPeerDevices(void)
{
    uint8_t i;
    for( i = 0; i < gAppMaxConnections_c; i++ )
    {
        if(maPeerDeviceId[i].deviceId != gInvalidDeviceId_c)
        {
            (void)Gap_Disconnect(maPeerDeviceId[i].deviceId);
        }
    }
}
#endif /*gAppButtonCnt_c > 0*/

/*! *********************************************************************************
* \brief        Returns the number of peer devices in the array
*
* \param[in]    none
********************************************************************************** */
static uint8_t NumberOf_PeerDevices(void)
{
    uint8_t i;
    uint8_t peerNo = 0;
    for( i = 0; i < gAppMaxConnections_c; i++ )
    {
        if(maPeerDeviceId[i].deviceId != gInvalidDeviceId_c)
        {
            peerNo++;
        }
    }
 return peerNo;
}

