nxp-mcuxpresso/mcux-sdk-examples/kw45b41zevk/wireless_examples/bluetooth/adv_ext_peripheral/adv_ext_peripheral.c
static void BleApp_SerialInit(void)
{
    serial_manager_status_t status;

    /* UI */
    gAppSerMgrIf = (serial_handle_t)&gSerMgrIf[0];

    /*open wireless uart read/write handle*/
    status = SerialManager_OpenWriteHandle((serial_handle_t)gAppSerMgrIf, (serial_write_handle_t)s_writeHandle);
    assert(kStatus_SerialManager_Success == status);
    (void)status;

    status = SerialManager_OpenReadHandle((serial_handle_t)gAppSerMgrIf, (serial_read_handle_t)s_readHandle);
    assert(kStatus_SerialManager_Success == status);
}

static void BleApp_HandleExtAdvNonConnNonScannMode(uint8_t mode)
{
    mAppExtAdvParams.duration = gBleExtAdvNoDuration_c;
    mAppExtAdvParams.maxExtAdvEvents = gBleExtAdvNoMaxEvents_c;

    if(ExtAdvAPIRequest((advIndex_t)mode) == gApiReq_Denied_c)
    {
        AppPrintString("\n\rAnother Advertising Operation in Progress. Try later...");
    }
    else
    {
        if (maAdvStatus[mode] == mAdvStatus_Off_c)
        {
            maPExtAdvParam[mode]->handle = Alloc_AdvHandler();
            if(maPExtAdvParam[mode]->handle == mInvalidAdvHandle)
            {
                AppPrintString("\n\r No Advertising Handle Available. Stop Another Advertising");
                FreeExtAdvAPI();
            }
            else
            {
                mAppExtAdvParams.pGapExtAdvParams = maPExtAdvParam[mode];
                mAppExtAdvParams.handle = maPExtAdvParam[mode]->handle;
                mAppExtAdvParams.pGapAdvData = maPExtAdvData[mode];
                mAppExtAdvParams.pScanResponseData = maPExtScanData[mode];

                if(((uint8_t)maLastAdvIndexForThisHandle[maPExtAdvParam[mode]->handle] == mode) || (maLastAdvIndexForThisHandle[maPExtAdvParam[mode]->handle] == mAdvIndexMax_c))
                {
                    if(gBleSuccess_c == BluetoothLEHost_StartExtAdvertising(&mAppExtAdvParams, BleApp_AdvertisingCallback, BleApp_ConnectionCallback))
                    {
                        mExtAdvSequence = mExtAdvSeq_Start_c;
                    }
                    else
                    {
                        AppPrintString("\n\rGap_SetExtAdvertisingParameters failed");
                        Free_AdvHandler(maPExtAdvParam[mode]->handle);
                        FreeExtAdvAPI();
                    }
                }
                else
                {
                    if(gBleSuccess_c == Gap_RemoveAdvSet(maPExtAdvParam[mode]->handle))
                    {
                        mExtAdvSequence = mExtAdvSeq_Start_c;
                    }
                    else
                    {
                        AppPrintString("\n\rGap_RemoveAdvSet failed");
                        Free_AdvHandler(maPExtAdvParam[mode]->handle);
                        FreeExtAdvAPI();
                    }
                }
            }
        }
        else if(maAdvStatus[mode] ==  mAdvStatus_On_c)
        {
            if((mode == (uint8_t)mExtAdvNonConnNonScanIndex_c) && (maAdvStatus[mPeriodicAdvIndex_c] == mAdvStatus_On_c) )
            {
                AppPrintString("\n\rPeriodic Advertising is ON. Stop the Periodic Advertising First");
                FreeExtAdvAPI();
            }
            else
            {
                if(gBleSuccess_c == Gap_StopExtAdvertising(maPExtAdvParam[mode]->handle))
                {
                    mExtAdvSequence = mExtAdvSeq_Stop_c;
                }
                else
                {
                    AppPrintString("\n\rGap_StopExtAdvertising failed");
                    FreeExtAdvAPI();
                }
            }
        }
        else
        {
            FreeExtAdvAPI();
        }
    }
}

static void BleApp_HandlePeriodicAdvMode(uint8_t mode)
{
    if(maAdvStatus[mExtAdvNonConnNonScanIndex_c] !=  mAdvStatus_On_c)
    {
        AppPrintString("\n\rThis Option Requires Extended Non Connectable Non Scanable Advertising to be On   ");
    }
    else
    {
        if(ExtAdvAPIRequest((advIndex_t)mode) == gApiReq_Denied_c)
        {
            AppPrintString("\n\rAnother Advertising Operation in Progress. Try later...");
        }
        else
        {
            if(maAdvStatus[mode] ==  mAdvStatus_Off_c)
            {
                gPeriodicAdvParams.handle = gExtAdvParamsNonConnNonScann.handle;
                if(Gap_SetPeriodicAdvParameters(&gPeriodicAdvParams) == gBleSuccess_c )
                {
                    mExtAdvSequence = mExtAdvSeq_Start_c;
                }
                else
                {
                    AppPrintString("\n\rGap_SetPeriodicAdvParameters failed");
                    FreeExtAdvAPI();
                }
            }
            else if(maAdvStatus[mode] ==  mAdvStatus_On_c)
            {
                if(Gap_StopPeriodicAdvertising(gPeriodicAdvParams.handle) != gBleSuccess_c )
                {
                    AppPrintString("\n\rGap_StopPeriodicAdvertising failed");
                    FreeExtAdvAPI();
                }
                else
                {
                    mExtAdvSequence = mExtAdvSeq_Stop_c;
                }
            }
            else
            {
                FreeExtAdvAPI();
            }
        }
    }
}

static void BleApp_HandleChangePerAdvDataMode(void)
{
    if(ExtAdvAPIRequest(mPeriodicAdvIndex_c) == gApiReq_Denied_c)
    {
        AppPrintString("\n\rAnother Advertising Operation in Progress. Try later...");
    }
    else
    {
        mPeriodicAdvDataIndex ^= 1U;
        if(Gap_StopPeriodicAdvertising(gPeriodicAdvParams.handle) != gBleSuccess_c )
        {
            mPeriodicAdvDataIndex ^= 1U;
            AppPrintString("\n\rGap_StopPeriodicAdvertising Failed");
            FreeExtAdvAPI();
        }
        else
        {
            mExtAdvSequence = mExtAdvSeq_ChangePeriodicData_c;
        }
    }
}

static void BleApp_HandleChangeNonConnNonScannAdvDataMode(void)
{
    if(ExtAdvAPIRequest(mExtAdvNonConnNonScanIndex_c) == gApiReq_Denied_c)
    {
        AppPrintString("\n\rAnother Advertising Operation in Progress. Try later...");
    }
    else
    {
        mExtAdvDataNCNSIndex ^= 1U;
        maPExtAdvData[mExtAdvAPIOwner] = maPExtAdvDataNonConnNonScan[mExtAdvDataNCNSIndex];

        if(gBleSuccess_c != Gap_StopExtAdvertising(maPExtAdvParam[mExtAdvAPIOwner]->handle))
        {
            AppPrintString("\n\rGap_StopExtAdvertising Failed");
            mExtAdvDataNCNSIndex ^= 1U;
            maPExtAdvData[mExtAdvAPIOwner] = maPExtAdvDataNonConnNonScan[mExtAdvDataNCNSIndex];
            FreeExtAdvAPI();
        }
        else
        {
            mExtAdvSequence = mExtAdvSeq_ChangeExtAdvData_c;
        }
    }
}

/*! *********************************************************************************
* @}
********************************************************************************** */
